case1_1/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.0001367082;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.0001367082;
    }
    outlet
    {
        type            zeroGradient;
    }
    upperwall
    {
        type            symmetry;
    }
    lowerwall
    {
        type            symmetry;
    }
    pipe1
    {
        type            kqRWallFunction;
        value           uniform 0.0001367082;
    }
    pipe2
    {
        type            kqRWallFunction;
        value           uniform 0.0001367082;
    }
    frontandback
    {
        type            empty;
    }	
}


// ************************************************************************* //
