case1_1/0/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    frontandback
    {
        type            empty;
    }
    upperwall
    {
        type            symmetry;
    }
    lowerwall
    {
        type            symmetry;
    }
    pipe1
    {
        type            calculated;
        value           nonuniform List<scalar> 
176
(
8.61431
8.61431
18.1117
18.1117
11.1822
14.0796
11.1822
14.0796
...
)
;
    }
    pipe2
    {
        type            calculated;
        value           nonuniform List<scalar> 
176
(
17.3293
17.3293
20.7763
17.0469
17.3061
17.3061
13.1782
7.74816
...
)
;
    }
}


// ************************************************************************* //
